IDENTIFICATION DIVISION.
PROGRAM-ID. CUSTOMER.

DATA DIVISION.

WORKING-STORAGE SECTION.

01 CUSTOMER-ID      PIC 9(5).
01 CUSTOMER-NAME    PIC X(30).
01 CUSTOMER-AGE     PIC 99.

PROCEDURE DIVISION.

MAIN.

    PERFORM VALIDATE-CUSTOMER.

VALIDATE-CUSTOMER.

    IF CUSTOMER-AGE < 18
       DISPLAY 'INVALID'
    END-IF.

    STOP RUN.